Jajukym/hello-world/Cypress/PowerSupply test/PowerSupply test.cydsn/Generated_Source/PSoC4/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "pinRelay.h"
#include "pinRelay_aliases.h"
#include "pinSwitchIndicator.h"
#include "pinSwitchIndicator_aliases.h"
#include "LCD.h"
#include "pinRS.h"
#include "pinRS_aliases.h"
#include "pinE.h"
#include "pinE_aliases.h"
#include "pinDB4.h"
#include "pinDB4_aliases.h"
#include "pinDB5.h"
#include "pinDB5_aliases.h"
#include "pinDB6.h"
#include "pinDB6_aliases.h"
#include "pinDB7.h"
#include "pinDB7_aliases.h"
#include "pinBacklight.h"
#include "pinBacklight_aliases.h"
#include "Clock_1.h"
#include "PWMBacklight.h"
#include "LCD_Cntl_Port.h"
#include "core_cm0_psoc4.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "CyLFClk.h"
#include "cy_em_eeprom.h"

/*[]*/

